Nepike/thesis-remote-robotics-lab/firmware/esp32-microbot/esp32microbot.ino
/*
 * esp32microbot — прошивка трёхколёсного микро-робота лаборатории.
 *
 * Роль в системе.
 *   В отличие от esp32gateway (тупой мост «TCP ↔ UART» перед Arduino робота),
 *   здесь ESP32 — это И приёмник, И контроллер одновременно. Отдельного
 *   низкоуровневого МК нет: та же самая микросхема держит WiFi, разбирает
 *   команды сервера, крутит моторы и читает датчики.
 *
 *   Следствие, о котором стоит помнить: управляющий цикл делит процессор со
 *   стеком WiFi. Поэтому в loop() нет ни одного delay() — всё расписано по
 *   millis(), а loop() обязан прокручиваться быстро.
 *
 * Что умеет.
 *   - принимает twist (v, ω) по TCP, как yarp-13 через cmd_vel;
 *   - отдаёт телеметрию: три дальномера, напряжение батареи, текущий setpoint;
 *   - принимает коэффициенты ПИД (регулятор пока разомкнут, см. раздел ПИД);
 *   - выбор WiFi-сети с экранчика четырьмя кнопками, выбор живёт в NVS;
 *   - дедман: пропали команды или отвалился клиент — моторы в ноль.
 *
 * Протокол (строки, \n в конце, регистр команды не важен).
 *   Сервер -> робот:
 *     TWIST <v> <w>        v м/с, w рад/с; каждая команда кормит дедман
 *     STOP                 немедленный ноль
 *     PID <kp> <ki> <kd>   коэффициенты регулятора (оба колеса)
 *     ARM <0|1>            программное разрешение силовой части
 *     PING                 проверка живости, робот отвечает PONG
 *   Робот -> сервер (телеметрия, _TELEMETRY_HZ раз в секунду):
 *     t=<мс>,rf_l=<см>,rf_c=<см>,rf_r=<см>,vbat=<В>,v=<м/с>,w=<рад/с>,
 *     pwm_l=<-255..255>,pwm_r=<...>,armed=<0|1>,kp=<..>,ki=<..>,kd=<..>
 *
 *   Формат «ключ=значение через запятую» взят не с потолка: ровно так уже
 *   разговаривает SimpleSerialDevice в manager/DeviceDrivers.py. Заодно строку
 *   видно глазами в `nc <ip> 2000`, без всяких библиотек разбора JSON на МК.
 *
 * Схема подключения — см. раздел «Распиновка». Питание платы дисплея — 3.3 В,
 * не 5 В: кнопки подтянуты к питанию модуля, а 5 В на GPIO ESP32 убивает вход.
 */

#include <WiFi.h>
#include <Wire.h>
#include <Preferences.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>


// ============================================================================
//  Распиновка
// ============================================================================
//
// Аналоговые входы взяты ТОЛЬКО из ADC1 (GPIO32-39). Это не вкусовщина: у ESP32
// блок ADC2 физически занят радиомодулем, и пока WiFi активен, analogRead() с
// любого пина ADC2 возвращает мусор либо просто виснет. Все четыре выбранных
// пина вдобавок input-only, то есть случайно назначить их выходом невозможно.

#define PIN_RF_LEFT    36   // Sharp GP2Y0A21, левый   (ADC1_CH0, он же VP)
#define PIN_RF_CENTER  39   // Sharp GP2Y0A21, средний (ADC1_CH3, он же VN)
#define PIN_RF_RIGHT   34   // Sharp GP2Y0A21, правый  (ADC1_CH6)
#define PIN_VBAT       35   // делитель напряжения батареи (ADC1_CH7)

// Драйвер моторов TB6612FNG. На мотор: одна линия ШИМ + два бита направления.
// STBY общий на обе половины моста: низкий уровень — силовая часть обесточена.
#define PIN_MOTOR_L_PWM  13
#define PIN_MOTOR_L_IN1  27
#define PIN_MOTOR_L_IN2  14
#define PIN_MOTOR_R_PWM   4
#define PIN_MOTOR_R_IN1  16
#define PIN_MOTOR_R_IN2  17
#define PIN_MOTOR_STBY   18

// Экран: I2C на штатных пинах ESP32.
#define PIN_I2C_SDA  21
#define PIN_I2C_SCL  22

// Кнопки на плате экрана (K1..K4). Замыкают вход на землю, подтяжка к питанию
// модуля — то есть нажатие это НОЛЬ. Внутренний INPUT_PULLUP включаем сверх
// внешнего специально: если провод кнопки оборвётся, вход прочитается как
// «не нажато». Отказ проводки не должен сам по себе что-то нажимать.
#define PIN_BTN_UP    32   // K1, маркировка «∧»
#define PIN_BTN_DOWN  33   // K2, маркировка «∨»
#define PIN_BTN_OK    25   // K3, маркировка «#»
#define PIN_BTN_BACK  26   // K4, маркировка «*»

#define PIN_LED        2   // встроенный светодиод платы

// Свободны под энкодеры, когда они появятся: GPIO19, GPIO23, GPIO5, GPIO15.
// Прерывания на ESP32 вешаются на любой GPIO, так что выбор непринципиален.


// ============================================================================
//  Геометрия и пределы
// ============================================================================

const float WHEEL_BASE_M     = 0.105f;  // расстояние между ведущими колёсами, м
const float MAX_WHEEL_SPEED  = 0.35f;   // скорость колеса при ШИМ 255, м/с
const int   PWM_MAX          = 255;
const int   PWM_MIN_MOVE     = 45;      // ниже этого мотор только гудит

// Дедман. Если TWIST не приходил дольше — setpoint обнуляется.
// Сервер стримит setpoint на 10 Гц, так что 500 мс это пять потерянных кадров.
const uint32_t CMD_TIMEOUT_MS = 500;

const uint32_t CONTROL_PERIOD_MS   = 20;   // 50 Гц: моторы и регулятор
const uint32_t SENSOR_PERIOD_MS    = 50;   // 20 Гц: опрос дальномеров
const uint32_t TELEMETRY_PERIOD_MS = 100;  // 10 Гц: отправка телеметрии
const uint32_t DISPLAY_PERIOD_MS   = 200;  // 5 Гц: перерисовка экрана

// Делитель напряжения батареи: VBAT --[R1]--+--[R2]-- GND, вход АЦП в середине.
// При 2S Li-ion (до 8.4 В) и R1=100к, R2=47к на вход приходит максимум 2.69 В —
// в пределах шкалы АЦП с аттенюацией 11 дБ.
const float VBAT_R1 = 100000.0f;
const float VBAT_R2 =  47000.0f;
const float VBAT_DIVIDER = (VBAT_R1 + VBAT_R2) / VBAT_R2;


// ============================================================================
//  Известные сети
// ============================================================================
//
// Ввод пароля четырьмя кнопками — это пытка, поэтому сети прошиты списком, а с
// экрана выбирается только нужная. Выбор переживает перезагрузку (NVS), так что
// меню нужно ровно один раз — когда робот переехал в другую лабораторию.
//
// TODO: вынести в конфигурацию (та же проблема, что и в esp32gateway).

struct WifiCred {
  const char* ssid;
  const char* pass;
};

const WifiCred WIFI_NETWORKS[] = {
  { "Nepike",  "123453119670" },
  { "lab-ap",  "" },
};
const int WIFI_NETWORK_COUNT = sizeof(WIFI_NETWORKS) / sizeof(WIFI_NETWORKS[0]);

const uint32_t WIFI_CONNECT_TIMEOUT_MS = 12000;

WiFiServer tcpServer(2000);   // порт совпадает с полем "port" в devices.json
WiFiClient tcpClient;

Preferences prefs;
int currentNetwork = 0;       // индекс в WIFI_NETWORKS


// ============================================================================
//  Экран
// ============================================================================

#define SCREEN_WIDTH  128
#define SCREEN_HEIGHT 64     // поставить 32, если модуль половинной высоты
#define OLED_I2C_ADDR 0x3C

Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);
bool displayPresent = false;

