Nepike/thesis-remote-robotics-lab/firmware/esp32-microbot/esp32microbot.ino
enum UiScreen { SCREEN_STATUS, SCREEN_MENU };
UiScreen uiScreen = SCREEN_STATUS;
int menuCursor = 0;


// ============================================================================
//  Состояние робота
// ============================================================================

// Уставка, пришедшая от сервера.
float targetV = 0.0f;       // м/с
float targetW = 0.0f;       // рад/с
uint32_t lastCmdMs = 0;     // когда последний раз кормили дедман

// Реально выданный на моторы ШИМ — уходит в телеметрию, по нему видно
// насыщение и работу компенсации мёртвой зоны.
int pwmLeft  = 0;
int pwmRight = 0;

// Программное разрешение силовой части. Снимается кнопкой «*» на экране или
// командой ARM 0 — удобно, когда робот на столе и крутить колёса не надо.
bool armed = true;

// Показания датчиков.
int   rfLeft = -1, rfCenter = -1, rfRight = -1;   // см, -1 = вне диапазона
float vbat = 0.0f;                                 // В


// ============================================================================
//  Дальномеры Sharp GP2Y0A21YK0F
// ============================================================================
//
// ВАЖНО, про этот датчик нужно знать две вещи.
//
// 1. Характеристика нелинейная и обратная: чем ближе препятствие, тем ВЫШЕ
//    напряжение. Пересчёт — эмпирическая степенная аппроксимация паспортного
//    графика, рабочий диапазон 10..80 см.
//
// 2. Ближе 10 см характеристика ЗАГИБАЕТСЯ обратно: на 4 см датчик отдаёт
//    примерно столько же, сколько на 30 см, и отличить эти два случая
//    принципиально невозможно. Поэтому строить на одном Sharp защиту от
//    столкновения нельзя — вплотную он рапортует «далеко». Здесь всё, что
//    выходит за 10..80 см, помечается как -1 («не знаю»), и решение оставлено
//    серверу. Для настоящего рефлекса нужен либо бампер, либо ToF-датчик.
//
// Выход датчика питается от 5 В и доходит до ~3.1 В на 6 см — это у самого
// верха шкалы АЦП, поэтому близкие препятствия упираются в насыщение. Для
// управления это не страшно (насыщение = «очень близко»), но точности там нет.

const float SHARP_CAL_A = 27.86f;   // d = A * U^B, паспортная аппроксимация
const float SHARP_CAL_B = -1.15f;
const int   SHARP_MIN_CM = 10;
const int   SHARP_MAX_CM = 80;
const int   SHARP_SAMPLES = 5;      // медиана: выбросы у Sharp это норма жизни

// Медиана нечётного числа отсчётов. Сортировка вставками на пяти элементах —
// это ~10 сравнений, дешевле любой библиотеки.
static uint32_t medianOf(uint32_t* buf, int n) {
  for (int i = 1; i < n; i++) {
    uint32_t key = buf[i];
    int j = i - 1;
    while (j >= 0 && buf[j] > key) {
      buf[j + 1] = buf[j];
      j--;
    }
    buf[j + 1] = key;
  }
  return buf[n / 2];
}

static int readSharpCm(int pin) {
  uint32_t samples[SHARP_SAMPLES];
  for (int i = 0; i < SHARP_SAMPLES; i++) {
    // analogReadMilliVolts применяет заводскую калибровку АЦП из eFuse —
    // заметно честнее, чем линейно пересчитывать сырые отсчёты 0..4095.
    samples[i] = analogReadMilliVolts(pin);
  }
  float volts = medianOf(samples, SHARP_SAMPLES) / 1000.0f;

  if (volts < 0.05f) return -1;   // датчик не подключён или видит пустоту

  float cm = SHARP_CAL_A * powf(volts, SHARP_CAL_B);
  if (cm < SHARP_MIN_CM || cm > SHARP_MAX_CM) return -1;
  return (int)(cm + 0.5f);
}

static void readSensors() {
  rfLeft   = readSharpCm(PIN_RF_LEFT);
  rfCenter = readSharpCm(PIN_RF_CENTER);
  rfRight  = readSharpCm(PIN_RF_RIGHT);

  uint32_t mv = analogReadMilliVolts(PIN_VBAT);
  float raw = (mv / 1000.0f) * VBAT_DIVIDER;
  // Экспоненциальное сглаживание: напряжение проседает на каждом рывке моторов,
  // и мигающая цифра на экране только мешает.
  vbat = (vbat == 0.0f) ? raw : (vbat * 0.9f + raw * 0.1f);
}


// ============================================================================
//  ПИД — ЗАГОТОВКА
// ============================================================================
//
// Сам регулятор написан целиком и рабочий. Не замкнут контур: на моторах пока
// нет энкодеров, а значит нет измеренной скорости, которую можно было бы
// подать в update(). Пока что ШИМ считается разомкнуто, из уставки напрямую.
//
// Что нужно сделать, когда энкодеры появятся:
//   1. повесить прерывания на фазы, считать тики за период;
//   2. в controlStep() посчитать реальную скорость колеса в м/с:
//        v = ticks / TICKS_PER_REV * WHEEL_CIRCUM / dt;
//   3. заменить feedforward на pidLeft.update(targetVl, measuredVl, dt),
//      оставив feedforward слагаемым — сходится заметно быстрее;
//   4. поднять MICROBOT_CLOSED_LOOP.
// Коэффициенты уже ходят по сети и лежат в телеметрии, так что подбирать их
// можно будет прямо с клиента, не перепрошивая робота.
//
// Флаг специально не компилируется сам по себе: под ним стоит обращение к
// measuredVL/measuredVR, которых пока нет. Это не забытая ошибка, а защёлка —
// включить замкнутый контур, не заведя обратную связь, нельзя.

#define MICROBOT_CLOSED_LOOP 0

struct Pid {
  float kp = 0.8f, ki = 0.0f, kd = 0.0f;
  float integral = 0.0f;
  float prevError = 0.0f;
  float outMin = -PWM_MAX, outMax = PWM_MAX;

  void reset() {
    integral = 0.0f;
    prevError = 0.0f;
  }

  float update(float target, float measured, float dt) {
    float error = target - measured;
    float p = kp * error;

    // Anti-windup: интеграл копим только если выход ещё не упёрся в предел.
    // Иначе после долгого насыщения регулятор «переедет» уставку и будет
    // отрабатывать назад — классические качели.
    float dTerm = (dt > 0.0f) ? kd * (error - prevError) / dt : 0.0f;
    float candidate = p + ki * (integral + error * dt) + dTerm;
    if (candidate > outMin && candidate < outMax) {
      integral += error * dt;
    }

    prevError = error;
    float out = p + ki * integral + dTerm;
    if (out > outMax) out = outMax;
    if (out < outMin) out = outMin;
    return out;
  }
};

Pid pidLeft, pidRight;


// ============================================================================
//  Моторы (TB6612FNG)
// ============================================================================

const int LEDC_CH_LEFT  = 0;
const int LEDC_CH_RIGHT = 1;
const int LEDC_FREQ_HZ  = 20000;   // выше слышимого, моторы не пищат
const int LEDC_BITS     = 8;       // разрешение 0..255, как PWM_MAX

static void motorsBegin() {
  pinMode(PIN_MOTOR_L_IN1, OUTPUT);
  pinMode(PIN_MOTOR_L_IN2, OUTPUT);
  pinMode(PIN_MOTOR_R_IN1, OUTPUT);
  pinMode(PIN_MOTOR_R_IN2, OUTPUT);
  pinMode(PIN_MOTOR_STBY,  OUTPUT);
  digitalWrite(PIN_MOTOR_STBY, LOW);   // силовая часть спит до конца инициализации

  // API светодиодного ШИМ переименовали в Arduino-core 3.x. Проект живёт на
  // 2.x (см. комментарий про flush() в esp32gateway), но пусть собирается и там.
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttachChannel(PIN_MOTOR_L_PWM, LEDC_FREQ_HZ, LEDC_BITS, LEDC_CH_LEFT);
  ledcAttachChannel(PIN_MOTOR_R_PWM, LEDC_FREQ_HZ, LEDC_BITS, LEDC_CH_RIGHT);
#else
  ledcSetup(LEDC_CH_LEFT,  LEDC_FREQ_HZ, LEDC_BITS);
  ledcSetup(LEDC_CH_RIGHT, LEDC_FREQ_HZ, LEDC_BITS);
  ledcAttachPin(PIN_MOTOR_L_PWM, LEDC_CH_LEFT);
  ledcAttachPin(PIN_MOTOR_R_PWM, LEDC_CH_RIGHT);
#endif
}

