Nepike/thesis-remote-robotics-lab/firmware/esp32-microbot/esp32microbot.ino
static void ledcWritePwm(int channel, int duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  // В 3.x канал адресуется через пин, к которому он привязан.
  ledcWriteChannel(channel, duty);
#else
  ledcWrite(channel, duty);
#endif
}

// pwm в диапазоне [-255, 255]: знак — направление, модуль — заполнение.
// Ноль означает мягкий выбег (IN1=IN2=0), а не электрическое торможение:
// для лёгкого робота резкий брейк на каждой остановке лишний.
static void motorWrite(int in1, int in2, int channel, int pwm) {
  if (pwm > PWM_MAX)  pwm = PWM_MAX;
  if (pwm < -PWM_MAX) pwm = -PWM_MAX;

  if (pwm > 0) {
    digitalWrite(in1, HIGH);
    digitalWrite(in2, LOW);
  } else if (pwm < 0) {
    digitalWrite(in1, LOW);
    digitalWrite(in2, HIGH);
  } else {
    digitalWrite(in1, LOW);
    digitalWrite(in2, LOW);
  }
  ledcWritePwm(channel, abs(pwm));
}

static void motorsStop() {
  pwmLeft = 0;
  pwmRight = 0;
  motorWrite(PIN_MOTOR_L_IN1, PIN_MOTOR_L_IN2, LEDC_CH_LEFT,  0);
  motorWrite(PIN_MOTOR_R_IN1, PIN_MOTOR_R_IN2, LEDC_CH_RIGHT, 0);
  pidLeft.reset();
  pidRight.reset();
}


// ============================================================================
//  Кинематика и управляющий цикл
// ============================================================================

// Компенсация мёртвой зоны: мотор трогается только с некоторого ШИМ, поэтому
// всё ненулевое поднимаем до PWM_MIN_MOVE. Без этого маленькие уставки просто
// греют обмотку, а робот стоит.
static int applyDeadband(float pwm) {
  int v = (int)(pwm + (pwm >= 0 ? 0.5f : -0.5f));
  if (v == 0) return 0;
  if (abs(v) < PWM_MIN_MOVE) v = (v > 0) ? PWM_MIN_MOVE : -PWM_MIN_MOVE;
  return v;
}

static void controlStep(float dt) {
  // Дедман. Проверяется здесь, а не в разборе команд: молчание — это тоже
  // событие, и заметить его может только тот, кто тикает по таймеру.
  if (millis() - lastCmdMs > CMD_TIMEOUT_MS) {
    targetV = 0.0f;
    targetW = 0.0f;
  }

  if (!armed) {
    digitalWrite(PIN_MOTOR_STBY, LOW);
    motorsStop();
    return;
  }
  digitalWrite(PIN_MOTOR_STBY, HIGH);

  // Дифференциальная раскладка twist на колёса — та же, что у yarp-13.
  float vL = targetV - targetW * WHEEL_BASE_M / 2.0f;
  float vR = targetV + targetW * WHEEL_BASE_M / 2.0f;

#if MICROBOT_CLOSED_LOOP
  // Сюда подставить измеренную энкодерами скорость (см. раздел ПИД).
  float outL = pidLeft.update(vL, measuredVL, dt);
  float outR = pidRight.update(vR, measuredVR, dt);
#else
  (void)dt;
  // Разомкнутый контур: скорость колеса считаем линейной по заполнению ШИМ.
  float outL = vL / MAX_WHEEL_SPEED * PWM_MAX;
  float outR = vR / MAX_WHEEL_SPEED * PWM_MAX;
#endif

  // Если одно колесо упёрлось в потолок, масштабируем ОБА, сохраняя отношение.
  // Иначе на быстрой дуге насыщается внешнее колесо, соотношение скоростей
  // ломается, и робот уезжает не по той кривой, которую заказали.
  float peak = max(fabsf(outL), fabsf(outR));
  if (peak > PWM_MAX) {
    outL *= PWM_MAX / peak;
    outR *= PWM_MAX / peak;
  }

  pwmLeft  = applyDeadband(outL);
  pwmRight = applyDeadband(outR);

  motorWrite(PIN_MOTOR_L_IN1, PIN_MOTOR_L_IN2, LEDC_CH_LEFT,  pwmLeft);
  motorWrite(PIN_MOTOR_R_IN1, PIN_MOTOR_R_IN2, LEDC_CH_RIGHT, pwmRight);
}


// ============================================================================
//  Разбор команд
// ============================================================================

// Читает до n чисел, разделённых пробелами, начиная с позиции after.
// Возвращает, сколько удалось прочитать.
static int parseFloats(const String& s, int from, float* out, int n) {
  int count = 0;
  int i = from;
  while (count < n && i < (int)s.length()) {
    while (i < (int)s.length() && s[i] == ' ') i++;
    if (i >= (int)s.length()) break;
    int j = i;
    while (j < (int)s.length() && s[j] != ' ') j++;
    out[count++] = s.substring(i, j).toFloat();
    i = j;
  }
  return count;
}

static void handleLine(String line) {
  line.trim();
  if (line.length() == 0) return;

  int sp = line.indexOf(' ');
  String verb = (sp < 0) ? line : line.substring(0, sp);
  verb.toUpperCase();
  int argsAt = (sp < 0) ? line.length() : sp + 1;

  if (verb == "TWIST") {
    float a[2] = {0.0f, 0.0f};
    if (parseFloats(line, argsAt, a, 2) == 2) {
      targetV = a[0];
      targetW = a[1];
      lastCmdMs = millis();
    }

  } else if (verb == "STOP") {
    targetV = 0.0f;
    targetW = 0.0f;
    lastCmdMs = millis();
    motorsStop();

  } else if (verb == "PID") {
    float a[3];
    if (parseFloats(line, argsAt, a, 3) == 3) {
      pidLeft.kp = pidRight.kp = a[0];
      pidLeft.ki = pidRight.ki = a[1];
      pidLeft.kd = pidRight.kd = a[2];
      // Накопленный интеграл считался по старым коэффициентам — с новыми он
      // означает уже не то же самое и даст рывок. Сбрасываем.
      pidLeft.reset();
      pidRight.reset();
    }

  } else if (verb == "ARM") {
    float a[1];
    if (parseFloats(line, argsAt, a, 1) == 1) {
      armed = (a[0] != 0.0f);
      if (!armed) motorsStop();
    }

  } else if (verb == "PING") {
    if (tcpClient && tcpClient.connected()) tcpClient.println("PONG");
  }
  // Неизвестная команда молча игнорируется: на общей линии мусор случается,
  // и падать из-за него робот не должен.
}

static void sendTelemetry() {
  if (!tcpClient || !tcpClient.connected()) return;

  char buf[224];
  snprintf(buf, sizeof(buf),
           "t=%lu,rf_l=%d,rf_c=%d,rf_r=%d,vbat=%.2f,v=%.3f,w=%.3f,"
           "pwm_l=%d,pwm_r=%d,armed=%d,kp=%.3f,ki=%.3f,kd=%.3f",
           (unsigned long)millis(), rfLeft, rfCenter, rfRight, vbat,
           targetV, targetW, pwmLeft, pwmRight, armed ? 1 : 0,
           pidLeft.kp, pidLeft.ki, pidLeft.kd);
  tcpClient.println(buf);
}


// ============================================================================
//  Кнопки
// ============================================================================

// Конструктор, а не инициализация по месту: ESP32-core 2.x собирает скетчи как
// C++11, где структура с умолчаниями у полей перестаёт быть агрегатом, и
// запись вида Button b{PIN} просто не компилируется.
struct Button {
  uint8_t pin;
  bool lastLevel;             // HIGH = отпущена (подтяжка к питанию)
  uint32_t lastChangeMs;
  bool pressedEdge;

  explicit Button(uint8_t p)
    : pin(p), lastLevel(true), lastChangeMs(0), pressedEdge(false) {}
};

