Nepike/thesis-remote-robotics-lab/firmware/esp32-microbot/esp32microbot.ino
Button btnUp(PIN_BTN_UP), btnDown(PIN_BTN_DOWN), btnOk(PIN_BTN_OK), btnBack(PIN_BTN_BACK);

const uint32_t BTN_DEBOUNCE_MS = 30;

static void pollButton(Button& b) {
  b.pressedEdge = false;
  bool level = digitalRead(b.pin);
  uint32_t now = millis();
  if (level != b.lastLevel && now - b.lastChangeMs > BTN_DEBOUNCE_MS) {
    b.lastChangeMs = now;
    b.lastLevel = level;
    if (level == LOW) b.pressedEdge = true;   // нажатие — это фронт вниз
  }
}

static void pollButtons() {
  pollButton(btnUp);
  pollButton(btnDown);
  pollButton(btnOk);
  pollButton(btnBack);
}


// ============================================================================
//  Сеть
// ============================================================================

static void connectWifi(int index, bool showProgress);

static void renderConnecting(const char* ssid, int dots) {
  if (!displayPresent) return;
  display.clearDisplay();
  display.setCursor(0, 0);
  display.println(F("Connecting..."));
  display.println(ssid);
  display.setCursor(0, 24);
  for (int i = 0; i < dots; i++) display.print('.');
  display.display();
}

static void connectWifi(int index, bool showProgress) {
  if (index < 0 || index >= WIFI_NETWORK_COUNT) return;
  currentNetwork = index;

  motorsStop();          // на время переподключения робот стоит
  WiFi.disconnect(true);
  WiFi.mode(WIFI_STA);
  // Энергосбережение радио выключено по той же причине, что и в esp32gateway:
  // засыпающий модем добавляет задержки и рвёт соединение, а у нас по этому
  // каналу едет управление в реальном времени.
  WiFi.setSleep(false);
  WiFi.begin(WIFI_NETWORKS[index].ssid, WIFI_NETWORKS[index].pass);

  uint32_t start = millis();
  int dots = 0;
  while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_CONNECT_TIMEOUT_MS) {
    delay(250);   // единственное место с delay: робот ещё не управляется
    digitalWrite(PIN_LED, !digitalRead(PIN_LED));
    if (showProgress) renderConnecting(WIFI_NETWORKS[index].ssid, (++dots) % 16);
    Serial.print('.');
  }

  if (WiFi.status() == WL_CONNECTED) {
    digitalWrite(PIN_LED, HIGH);
    Serial.printf("\nConnected to %s, IP %s\n",
                  WIFI_NETWORKS[index].ssid, WiFi.localIP().toString().c_str());
    prefs.putInt("net", index);
    // end() перед begin() обязателен: после переподключения к WiFi слушающий
    // сокет остаётся привязан к СТАРОМУ адресу, а begin() у уже «слушающего»
    // сервера просто выходит, и робот навсегда перестаёт принимать соединения.
    tcpServer.end();
    tcpServer.begin();
  } else {
    digitalWrite(PIN_LED, LOW);
    Serial.printf("\nFailed to connect to %s\n", WIFI_NETWORKS[index].ssid);
    // Не достучались — показываем меню, пусть человек выберет другую сеть.
    uiScreen = SCREEN_MENU;
    menuCursor = index;
  }
}

// Накопитель незавершённой строки. Вынесен из функции, потому что его нужно
// очищать при подключении нового клиента: обрывок команды от прошлой сессии
// иначе приклеится к первой команде следующей и испортит её разбор.
String rxBuffer;

static void serviceTcp() {
  if (!tcpClient || !tcpClient.connected()) {
    WiFiClient incoming = tcpServer.available();
    if (incoming) {
      tcpClient = incoming;
      tcpClient.setNoDelay(true);   // низкая задержка важнее утилизации канала
      Serial.println("Client connected");
      rxBuffer = "";
      // Уставку с прошлой сессии не наследуем: новый клиент не заказывал
      // движение, а робот бы поехал.
      targetV = 0.0f;
      targetW = 0.0f;
      lastCmdMs = millis();
    }
    return;
  }

  // Строки читаем побайтно и накапливаем: readStringUntil() блокирует loop()
  // на таймаут, а нам нельзя — управляющий цикл встанет вместе с ним.
  while (tcpClient.available()) {
    char c = tcpClient.read();
    if (c == '\n') {
      handleLine(rxBuffer);
      rxBuffer = "";
    } else if (c != '\r') {
      if (rxBuffer.length() < 128) rxBuffer += c;   // защита от бесконечной строки
      else rxBuffer = "";
    }
  }
}


// ============================================================================
//  Отрисовка
// ============================================================================

static void renderStatus() {
  display.clearDisplay();
  display.setCursor(0, 0);

  bool wifiUp = (WiFi.status() == WL_CONNECTED);
  bool linkUp = tcpClient && tcpClient.connected();

  display.print(WIFI_NETWORKS[currentNetwork].ssid);
  display.println(wifiUp ? F(" +") : F(" -"));
  display.println(wifiUp ? WiFi.localIP().toString() : String("no ip"));

  display.print(linkUp ? F("LINK ") : F("---- "));
  display.println(armed ? F("ARMED") : F("SAFE"));

  if (SCREEN_HEIGHT >= 64) {
    display.printf("BAT %.2fV\n", vbat);
    display.printf("L%3d C%3d R%3d\n", rfLeft, rfCenter, rfRight);
    display.printf("v%.2f w%.2f\n", targetV, targetW);
  }
  display.display();
}

static void renderMenu() {
  display.clearDisplay();
  display.setCursor(0, 0);
  display.println(F("Select network:"));
  int rows = (SCREEN_HEIGHT >= 64) ? 6 : 3;
  // Окно прокрутки: курсор держим внутри видимых строк, чтобы список длиннее
  // экрана всё равно листался.
  int first = menuCursor - rows / 2;
  if (first < 0) first = 0;
  if (first > WIFI_NETWORK_COUNT - rows) first = WIFI_NETWORK_COUNT - rows;
  if (first < 0) first = 0;

  for (int i = first; i < WIFI_NETWORK_COUNT && i < first + rows; i++) {
    display.print(i == menuCursor ? F(">") : F(" "));
    display.print(i == currentNetwork ? F("*") : F(" "));
    display.println(WIFI_NETWORKS[i].ssid);
  }
  display.display();
}

static void renderUi() {
  if (!displayPresent) return;
  if (uiScreen == SCREEN_MENU) renderMenu();
  else                         renderStatus();
}

static void handleUiButtons() {
  if (uiScreen == SCREEN_STATUS) {
    if (btnUp.pressedEdge || btnOk.pressedEdge) {
      uiScreen = SCREEN_MENU;
      menuCursor = currentNetwork;
    }
    if (btnBack.pressedEdge) {
      // Локальный «выключатель силы». Полезно, когда робот на столе и его
      // трогают руками, а сервер продолжает слать уставки.
      armed = !armed;
      if (!armed) motorsStop();
    }
  } else {  // SCREEN_MENU
    if (btnUp.pressedEdge   && menuCursor > 0)                      menuCursor--;
    if (btnDown.pressedEdge && menuCursor < WIFI_NETWORK_COUNT - 1) menuCursor++;
    if (btnOk.pressedEdge) {
      uiScreen = SCREEN_STATUS;
      connectWifi(menuCursor, true);
    }
    if (btnBack.pressedEdge) uiScreen = SCREEN_STATUS;
  }
}


// ============================================================================
//  setup / loop
// ============================================================================

void setup() {
  Serial.begin(115200);

  pinMode(PIN_LED, OUTPUT);
  digitalWrite(PIN_LED, LOW);

