Nepike/thesis-remote-robotics-lab/firmware/esp32-microbot/esp32microbot.ino
  pinMode(PIN_BTN_UP,   INPUT_PULLUP);
  pinMode(PIN_BTN_DOWN, INPUT_PULLUP);
  pinMode(PIN_BTN_OK,   INPUT_PULLUP);
  pinMode(PIN_BTN_BACK, INPUT_PULLUP);

  // Полная шкала АЦП: выход Sharp доходит до ~3.1 В, делитель батареи до ~2.7 В.
  analogSetPinAttenuation(PIN_RF_LEFT,   ADC_11db);
  analogSetPinAttenuation(PIN_RF_CENTER, ADC_11db);
  analogSetPinAttenuation(PIN_RF_RIGHT,  ADC_11db);
  analogSetPinAttenuation(PIN_VBAT,      ADC_11db);

  motorsBegin();
  motorsStop();

  Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
  displayPresent = display.begin(SSD1306_SWITCHCAPVCC, OLED_I2C_ADDR);
  if (displayPresent) {
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.clearDisplay();
    display.display();
  } else {
    // Экран — это удобство, а не условие работы. Без него робот всё равно
    // поднимется на сохранённой сети и будет управляем.
    Serial.println("SSD1306 not found, running headless");
  }

  prefs.begin("microbot", false);
  int saved = prefs.getInt("net", 0);
  if (saved < 0 || saved >= WIFI_NETWORK_COUNT) saved = 0;

  lastCmdMs = millis();
  connectWifi(saved, true);
}

void loop() {
  uint32_t now = millis();
  static uint32_t lastControl = 0, lastSensors = 0, lastTelemetry = 0, lastDisplay = 0;

  pollButtons();
  handleUiButtons();

  // Сеть отвалилась — переподключаемся к той же сети. Моторы при этом не
  // трогаем явно: дедман в controlStep() обнулит уставку сам, потому что
  // команды перестанут приходить.
  if (WiFi.status() != WL_CONNECTED && uiScreen != SCREEN_MENU) {
    static uint32_t lastRetry = 0;
    if (now - lastRetry > 5000) {
      lastRetry = now;
      digitalWrite(PIN_LED, LOW);
      connectWifi(currentNetwork, false);
    }
  } else {
    serviceTcp();
  }

  if (now - lastSensors >= SENSOR_PERIOD_MS) {
    lastSensors = now;
    readSensors();
  }

  if (now - lastControl >= CONTROL_PERIOD_MS) {
    float dt = (now - lastControl) / 1000.0f;
    lastControl = now;
    controlStep(dt);
  }

  if (now - lastTelemetry >= TELEMETRY_PERIOD_MS) {
    lastTelemetry = now;
    sendTelemetry();
  }

  if (now - lastDisplay >= DISPLAY_PERIOD_MS) {
    lastDisplay = now;
    renderUi();
  }

  yield();   // отдаём процессор стеку WiFi и системному watchdog
}
